In [1]:
%load_ext magic_duckdb

In [7]:
%dql -cn duck.db

In [8]:
%dql SELECT * FROM songs

,id,name,artists
0,1,10000 Reasons,"[Jonas Myrin, Matt Redman]"
1,2,Agnus Dei,[Michael W. Smith]
2,3,Almighty (Ü),"[Anna Brading, Jotham Oakley, Simon Brading]"
3,4,Alpha and Omega,[Erasmus Mutanbira]
4,5,Amazing Grace/My chains are gone (Ü),[Chris Tomlin]
...,...,...,...
198,199,Yet Not I But Through Christ In Me,"[Jonny Robinson, Michael Farren, Rich Thompson]"
199,200,You Are Good,[Israel Houghton]
200,201,You Deserve It All,"[Josh Baldwin, Joe Volk, Bobby Strand, Kalley...]"
201,202,You're Worthy of My Praise,[David Ruis]
202,203,Zehntausend Gründe,"[David Hanheiser, David Schnitter, Jonas Myrin..."

In [9]:
%dql SELECT * FROM spotify

Empty DataFrame
Columns: [id, song_id, track_id]
Index: []

In [6]:
%dql --close